
      // && (Условный оператор И)   if [это] И [это] true, то код сработает
      // && (Логический оператор умножения)   Если с числами или строками, то затыкается на первом false (или последним true)

// 1 ============
var age = 18;
var accompanied = true;
/* Звучит так: "Если что-то из условия ниже не соблюдается (т.е. false), то код не сработает!"  или так:
"Если все условия соблюдаются (т.е. true), то код сработает" */
if (age >= 12 && accompanied) {     
  console.log("Можно проходить!")
} else {
  console.log("Вам вход запрещён!!!") 
}

// 2 ============
var hadShower = true;
var hasBackpack = false;

if (hadShower && hasBackpack){
  console.log("Можно идти в школу!")
} else {
  console.log("Ты не готов идти в школу!!!") 
}


true && true;   // true
false && true;  // false
true && false;  // false
false && false; // false

5 && 10;    // 10
-5 && 10;   // 10
0 && 20;    // 0
20 && 0;    // 0
0 && false; // 0

0 && 10;          // 0
null && 10;       // null
NaN && 10;        // Nan
undefined && 10;  // undefined
"" && 10;         // пусто


//========================================================

      // || (Условный оператор ИЛИ)   if [это] ИЛИ [это] true, то код сработает
      // || (Логический оператор сложения)   Если с числами или строками, то затыкается на первом true  (или последним false)

var hasApple = true;
var hasSandwich = false;
/* Звучит так: "Если что-то из условия ниже соблюдается (т.е. true), то код сработает!"  или   
"Если все условия не соблюдаются (т.е. false), то код не сработает" */
if (hasApple || hasOrange){
  console.log("Можно идти в школу!")
} else {
  console.log("Ты не готов идти в школу!!!") 
}

true || true;   // true
false || true;  // true
true || false;  // true
false || false; // false

5 || 10;    // 5
-5 || 10;   // -5 
0 || 20;    // 20
20 || 0;    // 20
false || 0; // 0

0 || 10;          // 10
null || 10;       // 10
NaN || 10;        // 10
undefined || 10;  // 10
"" || 10;         // 10



/*////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/



// Массивы (Arrays)

var dinosaursAndNumbers = [3, "динозавры", ["трицератопс", "стегозавр", 3627.5], 10];
console.log(dinosaursAndNumbers[2][0]);
console.log([3, "динозавры", ["трицератопс", "стегозавр", 3627.5], 10][2][0]);

var maniacs = ["Якко", "Вакко", "Дот"];
console.log(maniacs[maniacs.length - 1]);

dinosaursAndNumbers.push(100);
console.log(dinosaursAndNumbers);

var boringAnimals = ["Привет,", "меня", "зовут", "Bob!"];
console.log(boringAnimals.join(" "));  // преобразовывает и объединяет все эл. массива в одно строковое значение (в кавычках указывается разделитель)


// 1й вариант
let arr1 = [3, 2, 1];
console.log(arr1.join(" больше, чем "));
// console.log([3, 2, 1].join(" больше, чем "));

// 2й вариант
let arr2 = [3, 2, 1];
console.log(arr2[0] +  " больше, чем " + arr2[1] +  " больше, чем " + arr2[2]);
// console.log([3, 2, 1][0] +  " больше, чем " + [3, 2, 1][1] +  " больше, чем " + [3, 2, 1][2]);


// 3й вариант
let arr3 = [3, 2, 1];
let a2 = arr3[0];
let b2 = arr3[1];
let c2 = arr3[2];
console.log(`${a2} больше, чем ${b2} больше, чем ${c2}`);
// console.log(`${[3, 2, 1][0]} больше, чем ${[3, 2, 1][1]} больше, чем ${[3, 2, 1][2]}`);


/////////////////////

let jkhnkjn = ["рот", "нос", "ус"];
let ioj = Math.floor(Math.random() * (jkhnkjn.length));

let okhnkjn = ["воняет", "пахнет"];
let wob = Math.floor(Math.random() * (okhnkjn.length));

let iodrjgo =  ["туалет", "помойка"];
let glt = Math.floor(Math.random() * (iodrjgo.length));

console.log(`Твой ${jkhnkjn[ioj]} ${okhnkjn[wob]} как ${iodrjgo[glt]}`);
// console.log(`Твой ${["рот", "нос", "ус"][Math.floor(Math.random() * (jkhnkjn.length))]} ${["воняет", "пахнет"][Math.floor(Math.random() * (okhnkjn.length))]} как ${["туалет", "помойка"][Math.floor(Math.random() * (iodrjgo.length))]}`);



var text1 = "Hello world!";
console.log(text1[6]);  // Выведет букву w
text1[6] = "v";
console.log(text1);  // Буква не поменяется!!! В строках нельзя менять или добавлять буквы, только извлекать (выводить)!!!

var stringEmp = "";
stringEmp[0] = "Л"
stringEmp[1] = "о"
stringEmp[2] = "х"
console.log(stringEmp); // Выведет пустую строку

/*////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/



// Объекты (Objects)

let boy = {
  name1: "Bob",
  age: 20,
  lang: "eng"
};

boy.height = 180;
console.log(boy);

/////

let priceAuto1 = ["toyota", ["honda-auto", "honda-moto"], "mazda", "bmw"];                //Массив в массиве
let priceAuto2 = ["toyota", {auto:"honda-civic", moto:"honda-cmx500"}, "mazda", "bmw"];   //Объект в массиве
let priceMoto1 = {geon: 1600, tekken: 1800, lifan: [1650, 1850, 2150],};                  //Массив в объекте
let priceMoto2 = {geon: 1600, tekken: 1800, lifan: {kp: 1650, kpt: 1850, kpm: 2150},};    //Объект в объекте

console.log(priceAuto1[1][0]); //honda-auto
console.log(priceAuto2[1].moto); //honda-cmx500
console.log(priceMoto1.lifan[2]); //2150
console.log(priceMoto2.lifan.kpt); //1850

/////

var owedMoney = {};
owedMoney.Джимми = 5;
owedMoney.Анна = 7;
console.log(owedMoney);
owedMoney.Джимми += 3;
console.log(owedMoney);

/////

var movies = {
  "В поисках Немо": {
    releaseDate: 2003,
    duration: 100,
    actors: ["Альберт Брукс", "Эллен Дедженерес", "Александр Гоулд"],
    format: "DVD"
  },
  "Звездные войны: Эпизод VI — Возвращение джедая": {
    releaseDate: 1983,
    duration: 134,
    actors: ["Марк Хэмилл", "Харрисон Форд", "Кэрри Фишер"],
    format: "DVD"
  },
  "Гарри Поттер и Кубок огня": {
    releaseDate: 2005,
    duration: 157,
    actors: ["Дэниел Рэдклифф", "Эмма Уотсон", "Руперт Гринт"],
    format: "Blu-ray"
  }
  };

movies.Тачки = {
releaseDate: 2006,
duration: 117,
actors: ["Оуэн Уилсон", "Бонни Хант", "Пол Ньюман"],
format: "Blu-ray"
};

console.log(movies);
console.log(movies["Звездные войны: Эпизод VI — Возвращение джедая"].actors[1]);  // Если  в квадратных скобках нет запятых и есть пробелы ==> это не массив, а объект
console.log(movies.Тачки.actors[2]);

let kjiodtjgb = Object.keys(movies);  // возвращает МАССИВ из собственных перечисляемых свойств переданного объекта
console.log(kjiodtjgb);

/////

// 1й вариант
let scores1 = {Sara: 50, Bob: 10, Liza: 5, Mike: 80};

scores1.Sara += 5;
scores1.Bob += 10;
console.log(scores1);

// 2й вариант
let scores2 = {Sara: 50, Bob: 10, Liza: 5, Mike: 80};

function sumSara(scoresSara){
  return scores2.Sara += scoresSara;
}
function sumBob(scoresBob){
  return scores2.Bob += scoresBob;
}

console.log(scores2);
sumSara(5);
console.log(scores2);
sumSara(10);
console.log(scores2);
sumBob(20);
console.log(scores2);

/////

var myCrazyObject = {
  "name": "Нелепый объект",
  "some array": [7, 9, {purpose: "путаница", number: 123}, 3.3],
  "random animal": "Банановая акула"
  };

console.log(myCrazyObject["some array"][2].number);         //123
console.log(Object.keys(myCrazyObject["some array"][2]));   //["purpose", "number"]



/*////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/



// Циклы

for (var i = 3; i < 10000; i *= 3){
  console.log(i);
};
//----------------
var i = 3;
while(i < 10000){
  console.log(i);
  i *= 3;
}

/////
//Упражнение 1
var animals = ["Кот", "Рыба", "Лемур", "Комодский варан"];

for(i = 0; i < animals.length; i += 1){
  animals[i] = animals[i] + " - прекрасное животное" 
  // animals[i] += " - прекрасное животное" 
}
console.log(animals);


//////////////////////////////////////////
//Упражнение 2

var alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
var randomString = [];

var i = 0;
while(i < 6){
  var randomLatter = Math.floor(Math.random() * alphabet.length);
  randomString[i] = alphabet[randomLatter]
  console.log(randomString[i]);
  i += 1;
};
console.log(randomString);
console.log(randomString.join(""));




/*////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/



// Условия и взаимодействие с пользователем (alert, prompt, confirm)

// let name1 = prompt("Введите своё имя, пожалуйста");
// if(name1.length > 6){
//   alert(`Ну и длинющее у тебя имя, ${name1}! :)`);
// } else if(name1 === null || name1 === ""){
//   alert(`Спасибо, что посетили наш сайт!`);
// } else {
//   alert(`Добро пожаловать, ${name1}!`);
// }


// let jknjk = confirm("Я, confirm");
// if (jknjk === true) {
//   alert(`Привет, добро пожаловать! :)`)
// } else if (jknjk === false){
//   alert(`Ну пока, заходи ещё! =)`)
// } 


// let jhkjnrfq = "торт";
// let ojkkonmkl = "ягодный пирог";
// let jknjkq = prompt("Какой твой любимый десерт?");

// if (jknjkq === jhkjnrfq) {
//   alert(`У меня тоже :)`)
// } else if (jknjkq === "ojkkonmkl"){
//   alert(`${jknjkq} это вкусненько =)`)
// } else if (jknjkq === ""){
//   alert(`Написал бы хоть что-то`)
// } else if (jknjkq === null){
//   alert(`Ну пока, заходи ещё! =)`)
// }




var animals = ["Слон", "Тигр", "Жираф", "Лемур", "Медведь", "Зебра"];
for (i=0; i<animals.length; i+=1){
  console.log("В нашем зоопарке есть: " + animals[i] + ";");
  console.log(`В нашем зоопарке есть: ${animals[i]};`);
}

////////////

var text2 = "Hello world!"
for(var jsrhgg of text2){
  console.log(jsrhgg)
}

var text3 = ['H', 'e', 'l', 'l', 'o', ' ', 'w', 'o', 'r', 'l', 'd', '!']
for(var khng of text3){
  console.log(khng)
}

/////////////////////////////////////////////////

// var dfbvdv = prompt("Как вас зовут?");
// console.log(dfbvdv); // Ок - напечатает то что ввели; Отмена выведет null

// var dfbvdvdtb = confirm("Как вас зовут?");
// console.log(dfbvdvdtb); // Ок - выведет true; Отмена - false




/*////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
=========================================================================================================================
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/



// Функции


var sayHel = function () {
	let asdfg = 10	//Переменные объявленные внутри ф-ции работают только внутри этой ф-ции
	//console.log("Hello world!");
	return "Hello world!";
};
//sayHel();
console.log(sayHel());

/////

var oneHundred = function () {
  return 50 * 2; //Ф-ция возвращает только такое значение
};
console.log(oneHundred());

/////////////////////////

var double1 = function (number) {
  return number * 2; //Ф-ция возвращает всегда разные значения в зависимости от того какое значение аргумента введём при вызове ф-ции
};
console.log(double1(50));

// или так:

var double2 = function (number) {
  console.log(number * 2); //Ф-ция возвращает значения только в консоль (просто отображение содержимого), в дальнейшем это значение нельзя будет использовать в коде (см. строки ?448-?450)
};
double2(100);

/////////////////////

// var kjlkjl = prompt("Введите своё имя:")
// var sayHelloTo = function (yourName) {
//   // alert("Привет, " + yourName + "!");
//   alert(`Привет, ${yourName}!`);
// };
// sayHelloTo(kjlkjl);


var kjlhlkl = double1(50) + 111;
console.log(kjlhlkl);

var kjlhlkl6 = double2(50) + 111; //Эта строчка тоже вызывает в консоли ф-цию double2
console.log(kjlhlkl6);
console.log(double2(50) + 111); //И даже эта, помимо выражения ещё вызывает отдельно в консоли ф-цию double2

///////////////////////
console.log("Правильно вот так:");

var kjlhlkl1 = double1(50);
var dbgdb1 = kjlhlkl1 + 111;
console.log(dbgdb1);            // Этот код сработает

var kjlhlkl2 = double2(100);
var dbgdb2 = kjlhlkl2 + 111;
console.log(dbgdb2);            // Этот код не сработает






/*
Создайте две функции, add и multiply; пусть каждая принимает по два аргумента. Функция add должна складывать аргументыи возвращать результат, 
а функция multiply — перемножать аргументы. С помощью только этих двух функций вычислите следующее несложное выражение: 36325 * 9824 + 777
*/


function add (a, b){
  return a + b;
}
function multiply (a, b){
  return a * b;
}

var dhbstbv = multiply (36325, 9824);
console.log(add(dhbstbv, 777));
